<template>
  <div>
    <h2>实验室简介</h2>
    <el-divider></el-divider>
    <div>
      <h3>1.实验室项目选题背景</h3>
      <p>
        随着我国轨道交通行业的快速发展，为适应专门人才需求。《普通高等学校本科专业目录（2012年）》在自动化大类中增设了“轨道交通信号与控制”专业，培养城市轨道交通自动控制领域的高端技能型专门人才。从只有八所铁道高校开设该专业发展为有近百所本科高校陆续开设了该专业。该专业本科实验教育教学面临的问题主要为：
        大多数高校专业开设时间较短，师资短缺、实验资源匮乏；
        真实现场受制于安全因素不对外开放，无法实现校企合作教学；
        实验设备普遍体积较大、价格昂贵，操作具有一定危险性；
        系统应用场景无法在实验室重现，实验效果差；
        已有线上虚拟仿真实验项目尚无城市轨道交通相关内容。
      </p>

      <h3>2.实验室项目选题目的与意义</h3>
      <p>
        针对轨道交通信号与控制专业本科实验教学中存在的问题，本项目利用Unity
        3D虚拟仿真平台实现正线列车自动控制系统综合设计实验。
        对城市轨道交通正线运行场景、线路基础、自动控制设备等三维仿真建模，分析和模拟实际列车自动控制系统的组成、控制逻辑与实际应用方式，使参与实验的学生可以直观地完成课程实验要求内容，提高学生的专业知识水平和工程实践能力。
        通过对2019年所申报虚拟仿真实验项目《城市轨道交通”背景下电气设备联锁控制设计》中基础设备模块进行充实、优化，并完成城市轨道交通正线列车自动控制系统综合设计实验内容。形成一个完整的以城市轨道交通为特色的列车自动控制综合实验平台。
      </p>
      <h3>3.实验特色</h3>
      <div>
        <h4>1.选题新颖</h4>
        <p>
          城市轨道交通作为一种电能驱动、快捷便利的公共出行方式受到了众多城市的欢迎，也极大满足了居民的生活需要。在国家政策的推动下，我国城市轨道交通取得了巨大发展。截至2020年初，中国内地运营城市已达40座，包含地铁、轻轨、单轨、磁悬浮等系统在内，运营总里程激增至6730公里，开通城市数和运营里程在短短10年间分别增长了2.5倍和4.7倍。相应的，城市轨道交通的迅速发展也刺激了相应专业的人才需求的扩大，而人才培养的过程中需要的不仅仅是理论知识的学习，同时也需要现场的研究。但由于相关的实验进口设备价格过于昂贵，国产设备具有一定缺陷，实验安全性不足，这种教学资源缺乏的情况导致学生们无法切实地对实物进行学习。而虚拟仿真实验作为一种新兴的实验方式，具有安全、成本低、技术含量高、效果直观等优点恰好可以用在在轨道交通领域的教学与学习。
          国际而言，在铁路设备领域，由于我国轨道交通起步较晚，技术积累上有所不足，虽然近年来在高速铁路领域有所突破，但总体而言落后于欧美等发达国家。在虚拟仿真可视化领域，一些发达国家对未来教室和实验室的研究与应用较为成熟，产生了一批理念前瞻、技术先进、特点突出的建设成果，如:新加坡南洋理工大学的COTF、东京大学的KALS、德国伊尔默德国伊尔默瑙工业大学的虚拟现实实验室、美国明尼苏达大学的主动学习楼。但对于轨道设备控制领域，其虚拟仿真技术仅限于电路的逻辑表达，例如Multisim，Circuit
          Maker，并没有虚拟的设备效果展现。距离此领域的虚拟现实可视化还有很大的发展空间。
          国内而言，在轨道交通领域，取得了不小的突破，以高铁为代表的中国铁路也逐渐走向世界，因此也极大地增加了轨道行业的人才需求。目前在轨道行业实践教学主要面临三个大问题：（1）行业特殊性导致实验进展困难；（2）设备场地要求高导致实验错时段进行；（3）设备单调性导致缺乏规范和创新。虚拟仿真技术领域，已有一定的基础，在实践教学中已经取得了不小的成就，在一部分验证性实验进行难度较大，成本较高时，一般会优先考虑虚拟仿真技术，涉及行业领域十分广泛。例如东华大学纺织学院针对转杯纺纱机占地面积大、能耗高、不适合实践教学等缺点，设计了基于Unity3D仿真技术的转杯纺纱机教学应用软件，利用虚拟现实技术缩短了学生学习时间，同时提高了学习效率，为纺织专业教学改革提供了新思路。据万方数据平台数据统计，电子工业领域仿真软件占整体的30.1%，而交通行业的虚拟仿真内容仅占整体的5.2%。二者交叉的虚拟仿真内容占比不到总体1%，远远不能达到知识覆盖、人才培养的要求。
        </p>

        <h4>2.数据真实</h4>
        <p>
          本项目根据深圳11号线正线真实数据为基础构建实验场景，实验内容真实、实践作用明显。
        </p>

        <h4>3.定位明确</h4>
        <p>
          以“卓越工程师”为教学目标，实验操作与工程设计相结合，拓展实验深度。
          随着城市的发展，不同类型的城市轨道交通也会逐步规划与建设，需要相应的学校培养出适应不同地域的国际化的轨道交通人才。面对大力快速发展的城市轨道交通，轨道交通相关专业的人才需求量也大量增加，相关人才在国际化战略中的地位变得举足轻重。作为我国跨越式发展的城市轨道交通行业，既是机遇又是挑战。现如今轨道交通教学实验在过程中普遍存在出现“做不到、做不好、做不了、做不上”的问题。本项目借助于虚拟仿真平台，采用电气集中，面向在校学生、老师、车厂培训人员等用户，旨在帮助其更好地理解、学习轨道设备控制系统电气集中的电路原理，帮助其学习联锁的基本概念，为其将来学习计算机联锁提供有效的帮助。用户可以更加直观的感受电路逻辑的转变，知晓其中的原理，直观地表现不同逻辑情况下电路元件的作用。学校、车厂等场所可以根据自身实际情况充分利用虚拟现实实验的优势，将虚拟现实实验与非虚拟现实实验两者有机结合，激发学生的学习兴趣，提高本专业的教学质量。实现资金、资源、规模、结构、功能的最优化配置。
        </p>

        <h4>4.实验教学方法</h4>
        <p>
          采用直观展示与综合设计相结合的方式，解决了本领域已有国家实验项目以直观展示为主，学生设计操作不足的缺陷。
          随着以高铁为代表的中国铁路逐渐走向世界,轨道交通行业对人才的需求日益增加,轨道交通类专业办学规模日益扩大,教育部发布的《普通高等学校本科专业目录(2012年)》新增了“轨道交通信号与控制”专业。截至2020年底，我国开展轨道交通信号与控制专业高校已由传统的10余所开展到80余所。新开展院校的增多，以及轨道行业的特殊性，使轨道交通类专业甚至用人单位在开展实验教学的过程中出现了许多困难和挑战，主要包括：（1）轨道交通类实验往往是真实无法开展，甚至可能威胁到学员安全的实验，比如轨道交通事故再现与分析、列车不同速度下无线信道的变换、列车控制设备的装配等等；（2）部分轨道设施实验设备占地面积大，成本高昂，而单台套多轮次开展实验又无法满足大范围、多人次、同时段的实验教学要求；（3）新开通轨道专业的学校或者刚刚上市的用人单位往往会出现实验资源紧张的情况，还会出现原创性不足，缺乏统一标准等问题。然而随着教育信息化进程的推进，依托虚拟仿真实验教学中心的建设，是高校在实验教学改革的必然方向，为实验教学资源提供了多专业、多学校、多地区共享的可能。
          根据《关于加强城市轨道交通人才建设的指导意见》（发改基础【2017】74号）文件中关于“加强实训资源共享共用，有条件的普通高等学校、职业学校与城市轨道交通企业合作共建实训基地，城市轨道交通企业应对车辆段等自有土地资源进行综合利用，集约高效建设实训基地”的要求，该课程中的其中实践环节包括“课程实验”、“认识实习”、“生产实习”、“毕业设计”等。但其中“课程实验”对于很多学校或车间而言实现难度较大。现如今轨道交通教学实验在过程中普遍存在出现“做不到、做不好、做不了、做不上”的问题。针对此问题，本项目借助于虚拟仿真平台，采用电气集中，面向在校学生、老师、车厂培训人员等用户，旨在帮助其更好地理解、学习轨道设备控制系统电气集中的电路原理，帮助其学习联锁的基本概念，为其将来学习计算机联锁提供有效的帮助。虚拟现实实验教学通过视频演示、操作提示、帮助菜单等加强学生对实验内容的理解，能够提高其动手能力。将虚拟现实实验引入教学中具有投入少、见效快的优点，虚拟现实实验是高等教育实验建设的新思路、新途径、新方向。根据自身实际情况充分利用虚拟现实实验的优势，将虚拟现实实验与非虚拟现实实验两者有机结合，实现资金、资源、规模、结构、功能的最优化配置。
          建立这样一个虚拟可视化技术共享平台，可以为学生提供更加广阔的学习空间。当学生在实验课上没有准确完成实验，便可以借助此平台完成、验证自己的实验结果，以达到完成学习目标，巩固知识体系的目的。
          在满足部分条件下，本项目平台还可以为铁路调度员、轨道设计人员提供服务，为其提供相关的业务培训，还可以通过视景仿真系统提供信号系统设备的实际工作状态，使得相关岗位人员能够更加直观地感受到信号设备的变化，起到平台的培训效果。
        </p>

        <h4>5.校企合作</h4>
        <p>
          采用校企合作方式获取实验场景数据，向企业用户提供高效的技能训练平台。
        </p>
        <h4>6.自主开发</h4>
        <p>
          坚持自主开发原则，拓展学生能力，积极开展基于虚拟仿真系统的创新创业活动。
          实验项目应用方面 本实验平台开发采取
          “边开发、边优化”的方式，部分实验模块已在专业课程实验中实际运用。并在“新冠肺炎”疫情期间通过线上虚拟仿真实验教学，弥补了线下实验无法实现的问题。实验平台于累计服务用户
          200余人，并已申请2020年度校级实验开放项目，将于九月初向社会完全开放
        </p>
      </div>
    </div>
  </div>
</template>

<script>
export default {};
</script>

<style lang="less" scoped>
h2 {
  color: #565656;
}
h3 {
  margin: 1vh 0;
}
h4{
    text-indent: 2em;
    margin: 0.5vh 0 ;
}
p {
  line-height: 20px;
  font-size: 16px;
  text-indent: 2em;
}
</style>
